<template>
  <div>
    <div v-for="el of serv" :key="el.id" class="serv-text">
      <p>{{ el.title }}</p>
      <p>{{ el.text1 }}</p>
      <p>{{ el.text2 }}</p>
      <p>{{ el.text3 }}</p>
      <p>{{ el.text4 }}</p>
      <p>{{ el.text5 }}</p>
      <p>{{ el.text6 }}</p>
      <p>{{ el.text7 }}</p>
      <p>{{ el.text8 }}</p>
      <p>{{ el.text9 }}</p>
      <p>{{ el.text10 }}</p>
      <p>{{ el.text11 }}</p>
    </div>
    <div v-for="el of family" :key="el.id" class="family-text">
      <p>{{ el.title }}</p>
      <p>{{ el.text1 }}</p>
      <p>{{ el.text2 }}</p>
      <p>{{ el.price }}</p>
    </div>
    <div v-for="el of orders" :key="el.id" class="orders-text">
      <p>{{ el.title }}</p>
      <p>{{ el.text1 }}</p>
      <p>{{ el.text2 }}</p>
      <p>{{ el.text3 }}</p>
      <p>{{ el.text4 }}</p>
      <p>{{ el.text5 }}</p>
    </div>
  </div>
  <button @click="popup = true">заказать звонок</button>
</template>
<script setup lang="ts">
const popup = ref(false)

const { data } = await useFetch('/api/projects/project')



function translit(word: string) {
  var answer = '';
  var converter = {
    'а': 'a', 'б': 'b', 'в': 'v', 'г': 'g', 'д': 'd',
    'е': 'e', 'ё': 'e', 'ж': 'zh', 'з': 'z', 'и': 'i',
    'й': 'y', 'к': 'k', 'л': 'l', 'м': 'm', 'н': 'n',
    'о': 'o', 'п': 'p', 'р': 'r', 'с': 's', 'т': 't',
    'у': 'u', 'ф': 'f', 'х': 'h', 'ц': 'c', 'ч': 'ch',
    'ш': 'sh', 'щ': 'sch', 'ь': '', 'ы': 'y', 'ъ': '',
    'э': 'e', 'ю': 'yu', 'я': 'ya',

    'А': 'A', 'Б': 'B', 'В': 'V', 'Г': 'G', 'Д': 'D',
    'Е': 'E', 'Ё': 'E', 'Ж': 'Zh', 'З': 'Z', 'И': 'I',
    'Й': 'Y', 'К': 'K', 'Л': 'L', 'М': 'M', 'Н': 'N',
    'О': 'O', 'П': 'P', 'Р': 'R', 'С': 'S', 'Т': 'T',
    'У': 'U', 'Ф': 'F', 'Х': 'H', 'Ц': 'C', 'Ч': 'Ch',
    'Ш': 'Sh', 'Щ': 'Sch', 'Ь': '', 'Ы': 'Y', 'Ъ': '',
    'Э': 'E', 'Ю': 'Yu', 'Я': 'Ya'
  } as Record<string, string>

  for (var i = 0; i < word.length; ++i) {
    if (converter[word] == undefined) {
      answer += word[i];
    } else {
      answer += converter[word];
    }
  }
  answer = answer.trim().replaceAll(' ', '_').toLocaleLowerCase()
  return answer;
}

const serv = [
  { id: 1, title: 'Услуги', text1: 'Защита по делам об административных правонарушениях в области дорожного движения (ст. 12 КоАП РФ):', text2: 'Лишение права управления ТС (ст. 12.8, 12.26, 12.27)', text3: 'Оспаривание решений о назначении административного наказания', text4: 'Обжалование действий должностных лиц' },
  { id: 2, title: 'ВЕРНУТЬ ПРАВА ОТ 10 000 ₽!', text1: 'Полный комплекс услуг дистанционно', text2: 'Что входит в услугу?', text3: 'Обжалование действий должностных лиц', text4: 'Полная подготовка документов для суда по делам о нарушении ПДД (глава 12 КоАП РФ)', text5: 'Ходатайства:', text6: 'О прекращении дела за отсутствием состава правонарушения', text7: 'Об исключении протокола об АПН (неправильное оформление, отсутствие свидетелей и т. д.)', text8: 'О вызове в суд инспектора и понятых (если их показания критичны)', text9: 'Об исключении протокола об отстранении от управления ТС', text10: 'Об исключении протокола о направлении на медосвидетельствование', text11: 'Об исключении видеозаписи, схемы ДТП, объяснений понятых (при нарушениях в оформлении)' },
  { id: 3, title: 'Дополнительные документы для защиты:', text1: 'Вопросы для инспектора и понятых (чтобы выявить противоречия в их показаниях)', text2: 'Жалобы, отводы, заявления (если нарушены ваши права)', text3: 'Иные документы, необходимые для вашей победы в суде' },
  { id: 4, title: 'Оплата только после проверки документов!' }
]

const family = [
  { id: 1, title: 'Семейное право', text1: 'Предоставляем следующие услуги:', text2: 'Исковое заявление о разводе' },
  { id: 2, text2: 'Исковое заявление об определении места жительства ребенка' },
  { id: 3, text2: 'Исковое заявление о взыскании алиментов на детей' },
  { id: 4, text2: 'Исковое заявление о лишении родительских прав' },
  { id: 5, price: 'от 2500 ₽' }
]

const orders = [
  { id: 1, title: 'Судебные приказы', text1: 'Предоставляем следующие услуги:', text2: 'Составление заявления о выдаче судебного приказа (алименты, долги)', text3: 'Составление возражения на судебный приказ', text4: 'Составление возражения на судебный приказ', text5: 'Письменное заключение до отмены судебного приказа', price: 'от 2500 ₽' }
]
</script>
<style scoped>
.serv-text {
  color: white;
}

.family-text {
  color: yellow;
}

.orders-text {
  color: pink;
}
</style>