<template>services
  <div>
    <p>Защита по делам об административных правонарушениях в области дорожного движения (ст. 12 КоАП РФ):</p>
    <p>Лишение права управления ТС (ст. 12.8, 12.26, 12.27)</p>
    <p>Оспаривание решений о назначении административного наказания</p>
    <p>Обжалование действий должностных лиц</p>
  </div>
  <div>
    <p>ВЕРНУТЬ ПРАВА ОТ 10 000 ₽!</p>
    <p>Полный комплекс услуг дистанционно</p>
    <p>Что входит в услугу?</p>
    <p>Полная подготовка документов для суда по делам о нарушении ПДД (глава 12 КоАП РФ):</p>
    <p>&#10004;Ходатайства:</p>
    <ul>
      <li>О прекращении дела за отсутствием состава правонарушения</li>
      <li>Об исключении протокола об АПН (неправильное оформление, отсутствие свидетелей и т. д.)</li>
      <li>О вызове в суд инспектора и понятых (если их показания критичны)</li>
      <li>Об исключении протокола об отстранении от управления ТС</li>
      <li>Об исключении протокола о направлении на медосвидетельствование</li>
      <li>Об исключении видеозаписи, схемы ДТП, объяснений понятых (при нарушениях в оформлении)</li>
    </ul>
    <p>&#10004;Дополнительные документы для защиты:</p>
    <ul>
      <li>Вопросы для инспектора и понятых (чтобы выявить противоречия в их показаниях)</li>
      <li>Жалобы, отводы, заявления (если нарушены ваши права)</li>
      <li>Иные документы, необходимые для вашей победы в суде</li>
    </ul>
    <p>Оплата только после проверки документов!</p>
  </div>
</template>
<script setup lang="ts"></script>
<style scoped></style>